"""
1. 신문배달
각 층별로 [
    [101, 102, 104, 105, 109],
    [203, 205, 206, 208, 209],
    [301, 302, 303, 304, 305, 206, 307],
    [402, 404, 405, 406, 408, 410]
]

각 층별로 구독 취소 목록
[
    [101, 104],
    [205, 206, 208],
    [301, 305],
    [405, 406]
]

구독 취소 목록을 제외한 나머지 목록 가져오기
새로운 구독 목록만 출력
"""

dataList = [
    [101, 102, 104, 105, 109],
    [203, 205, 206, 208, 209],
    [301, 302, 303, 304, 305, 206, 307],
    [402, 404, 405, 406, 408, 410]
]

cancelList = [
    [101, 104],
    [205, 206, 208],
    [301, 305],
    [405, 406]
]

newList=[]
for i in range(0, len(dataList)):
    newItem = [item for item in dataList[i]
                if item not in cancelList[i]]
    newList.append(newItem)
print(newList)
